In [6]:
import pandas as pd

def find_managers(employee: pd.DataFrame) -> pd.DataFrame:
    df = employee.groupby('managerId').count().reset_index()
    df = df[df["id"] >= 5]
    id_set = set(df["managerId"])

    new_df = employee[employee["id"].isin(id_set)]
    return new_df[["name"]]

In [14]:
data = [[101, 'John', 'A', None], [102, 'Dan', 'A', 101], [103, 'James', 'A', 101], [104, 'Amy', 'A', 101], [105, 'Anne', 'A', 101], [106, 'Ron', 'B', 101]]
Employee = pd.DataFrame(data, columns=['id', 'name', 'department', 'managerId']).astype({'id':'Int64', 'name':'object', 'department':'object', 'managerId':'Int64'})
Employee

    id   name department  managerId
0  101   John          A       <NA>
1  102    Dan          A        101
2  103  James          A        101
3  104    Amy          A        101
4  105   Anne          A        101
5  106    Ron          B        101

In [15]:
find_managers(Employee)

   name
0  John

In [10]:
Employee.groupby('managerId').count().reset_index()

   managerId  id  name  department
0        101   4     4           4
1        103   1     1           1

In [12]:
Employee.groupby('managerId').size().reset_index(name="count")

   managerId  count
0        101      4
1        103      1